// // * Норма

// alert('Готові до швидкої JS подорожі?');

// let userName = prompt('Як тебе звуть, незнайомцю?', "Введи своє ім'я");

// alert(`Привіт та раді вітати, ${userName}!`);

// let userBirthYear = prompt(
//   'У якому році ти народився?',
//   'Введи свій рік народження'
// );
// const CURRENT_YEAR = 2022;

// if (!isNaN(parseFloat(userBirthYear)) && isFinite(userBirthYear))
//   alert(+CURRENT_YEAR - +userBirthYear + ', не багато!');
// else alert('You can enter only the number! I cannot calculate your age. Bye!');

// let squareSide = prompt(
//   'Введи довижу сторони квадрату, а я порахую тобі периметр :)',
//   'наприклад 7'
// );

// if (!isNaN(parseFloat(squareSide)) && isFinite(squareSide))
//   alert(+squareSide * 4);
// else alert('Периметр можна рахувати тільки з цілих чисел, а не літер. Бувай!');

// * Норма
// Запитай ім’я користувача та виведи у відповідь “Привіт, *ім’я*”;
// Запитай рік народження користувача, порахуй його/її вік і виведи результат. Поточний рік вкажи в коді як константу;
// Запитай у користувача довжину сторони квадрату і виведи периметр цього квадрата
// * Максимум
// Запитай у користувача радіус кола і виведи площу такої окружності.
// Запитай у користувача відстань в кілометрах між двома містами і за скільки годин він хоче дістатися. Порахуй швидкість, з якою необхідно рухатися, щоб встигнути вчасно.
// Реалізуй конвертор валют. Користувач вводить долари, програма переводить їх в євро. Курс валют зберігається в константі.

// * Максимум

let circleRadius = prompt(
  'Введи радіус кола, а я порахую тобі площу :)',
  'наприклад 7'
);

if (!isNaN(parseFloat(circleRadius)) && isFinite(circleRadius))
  alert((Math.PI * Math.pow(circleRadius, 2)).toFixed(2));
else alert('Площу можна рахувати тільки з цілих чисел, а не літер. Бувай!');
